[
    {
        "recipe_name": "Maple, Walnut and Bacon Brie Bites",
        "ingredients": ["8 mini Brie wheels" , "1/4 cup chopped toasted walnuts" , "1 tablespoon pure maple syrup" , "1 teaspoon apple-cider vinegar" , "5 slices cooked bacon (chopped)" , "Sliced scallions (for garnish)"],
        "directions": ["1. Preheat the oven to 250 degrees F", "2. On a baking sheet or ovensafe serving platter, bake the Brie wheels until warm to the touch and slightly oozy, 3 to 5 minutes. 3. In a small bowl, combine the walnuts, maple syrup, vinegar and bacon. Top each warmed Brie bite with a spoonful of the maple syrup mixture. Garnish with scallions. Serve immediately."],
        "recipe_type": "starters",
        "recipe_time": 15,
        "image": "/images/starter1-brie-bite.jpeg"
    
    },
    {
        "recipe_name": "Fresh Strawberry Cupcakes",
        "ingredients": ["1 2/3 cups flour", "1 tsp baking powder", "1/4 tsp baking soda", "1/2 tsp salt", "3/4 cup unsalted butter, melted" , "1 cup sugar" , "2 tsp vanilla extract" , "2 eggs" ,  "1/2 cup sour cream" ,  "1/4 cup + 2 tsp milk" , "1 1/2 cup chopped strawberries"],
        "directions": ["Preheat oven to 350 F" , "Sift flour, baking powder, baking soda & salt. Set aside" , "Whisk melted butter, sugar and vanilla" , "add eggs - whisk well" , "add sour cream - whisk well" , "add milk - whisk well" , "add dry ingredients - fold in gently" , "add strawberries - fold in gently" , "fill cupcake liners a little over halfway. Bake 18-20 minutes, or until a toothpick comes out clean"],
        "recipe_type": "desserts",
        "recipe_time": 30,
        "image": "/images/Strawberry-cup-cake.jpeg"
        
    },
    {
        "recipe_name": "Spatchcocked Turkey",
        "ingredients": ["1 Turkey, 8-12 pounds" , "10 garlic cloves, peeled and lightly crushed" , "1/2 teaspoon dried thyme" , "1/3 cup butter, melted" , "Salt and Pepper to taste"],
        "directions": ["Preheat oven to 450 F" , "Place turkey on stable cutting board, breast side down, and cut out backbone. Turn over, and press on it to flatten it out" , "Place turkey, breast side up, on roasting pan. Tuck garlic and and thyme under the bird, and in the nooks of the wings and legs" , "Roast for 20 minutes, or until it starts to brown. Remove from oven, baste with pan juices, and return to oven. Reduce temp to 400 F" , "Check turkey after 15 minutes. Remove when thigh meat reads 165 F. Check in multiple places to ensure proper cook-through" , "Let turkey rest for 10 minutes before carving. Serve with garlic cloves and pan juices"],
        "recipe_type": "entrees",
        "recipe_time": 45,
        "image": "/images/entree3-spatchcocked-turkey.jpeg"
       
    },
    {
        "recipe_name": "Deviled Eggs",
        "ingredients": ["12 large eggs" , "1/2 cup mayonnaise" , "1 tbsp Dijon mustard" , "1 to 2 dashes hot sauce" , "Salt and Pepper to taste" , "Finely chopped chives for garnish" , "Smoked Paprika for dusting"],
        "directions": ["Place eggs in single layer in saucepan, cover with 1 inch of water, and bring to boil" , "Lower heat to medium-low and simmer for 10 minutes. Transfer to bowl of ice water to cool completely, then peel the eggs" , "Slice eggs in half lengthwise, wiping the blade clean between each cut. Remove yolks to a separate bowl" , "Mash yolks with the mayonnaise, Dijon, hot sauce, salt and pepper. Transfer to large resealable plastic bag and snip off one corner with scissors" , "Place egg whites on platter, then evenly pipe the yolk filling into each egg. Top with chives and a sprinkle of Smoked Paprika" , "Refrigerate for 20-25 minutes prior to serving"],
        "recipe_type": "starters",
        "recipe_time": 40,
        "image": "/images/starter2-Deviled-Eggs.jpeg"
        
    },
    {
        "recipe_name": "Creamed Corn",
        "ingredients": ["2(10 ounce) packages frozen corn kernels, thawed" , "1 cup heavy cream" , "1 tsp salt" , "2 tbsp granulated sugar" , "1/4 tsp freshly ground black pepper" , "2 tbsp butter" , "1 cup whole milk" , "2 tbsp all-purpose flour" , "1/4 cup freshly grated Parmesan cheese"],
        "directions": ["In a skillet over medium heat, combine corn, heavy cream, salt, sugar, pepper, and butter." , "Whisk together the milk and flour, and stir into the corn mixture" , "Cook, stirring over medium heat until mixture is thickened and corn is cooked through" , "Remove from heat, and stir in Parmesan until melted. Serve hot"],
        "recipe_type": "sides",
        "recipe_time": 15,
        "image": "/images/side-3-creamed-corn.jpeg"
        
    },
    {
        "recipe_name": "Twice-Baked Fingerling Potatoes",
        "ingredients": ["24 baby Yukon Gold or red potatoes, each about 2 inches across (2 to 2-1/4 lb.)", "2 Tbs. olive oil", "2 tsp. chopped fresh thyme", "Kosher salt and freshly ground black pepper", "3 oz. bacon (about 3 thick slices)", "cooked until crispy and crumbled", "6 Tbs. thinly sliced fresh chives", "1/2 cup crème fraîche or sour cream", "1/2 cup coarsely grated Parmigiano-Reggiano"],
        "directions": ["Heat the oven to 425°F. Put the potatoes on a large baking sheet and toss with the olive oil. Sprinkle with 1 tsp. of the thyme, 1 tsp. salt, 1/2 tsp. pepper, and toss again. Bake the potatoes until they feel perfectly tender when pierced with a skewer, 20 to 25 minutes. Remove from the oven and let rest until cool enough to handle, about 10 minutes. If not working ahead, increase the oven temperature to 450°F.", "Carefully hollow out each potato: Begin by slicing off the top; use a small spoon to scoop out most of the flesh inside, transferring it to a large bowl. Discard the tops. Mash the potato flesh with a masher or a fork, then combine it with the bacon, 1/4 cup of the chives, the crème fraîche, the remaining 1 tsp. thyme, 1/2 tsp. salt, and 1/4 tsp. pepper. Season to taste with more salt and pepper.", "Using a small spoon and your fingers, fill the hollowed potatoes with this mixture; it should mound a bit. Sprinkle on the cheese.", "Return the potatoes to the 450°F oven and bake until the filling heats through, 8 to 10 minutes. Sprinkle with the remaining chives and serve warm."],
        "recipe_type": "starters",
        "recipe_time": 45,
        "image": "/images/starter3-Twice-baked-potatoes.jpg"
        
    },
    {
        "recipe_name": "Roasted-Eggplant",
        "ingredients": ["2 large eggplants (3 pounds), unpeeled, cut into 1 1/2-inch chunks", "2 tablespoons kosher salt", "1/2 medium shallot", "1 clove garlic", "1/2 cup flat-leaf parsley, packed", "2 tablespoons full flavored walnut oil", "1/4 cup extra-virgin olive oil, plus as needed", "1/2 teaspoon freshly ground pepper"],
        "directions": ["Put the eggplant pieces in a large colander and sprinkle all over with the 2 tablespoons kosher salt. Set in the sink to drain for about 30 minutes.", "Preheat oven to 425 degrees F.", "Put a baking sheet in the oven to heat for 10 minutes.", "Meanwhile, peel and finely chop the shallot and garlic, and push to the side of the cutting board. Chop the parsley, then draw the shallots and garlic in with the herbs and chop them together, until finely chopped. Stir the aromatics and walnut oil together in a serving bowl.", "Toss the purged eggplant with the olive oil and pepper. Carefully remove the hot baking sheet from the oven and brush or drizzle with olive oil. Spread the eggplant out on the pan and return to the oven. Roast until the eggplant is tender yet firm and rich brown, about 30 minutes. Remove from the oven, toss with garlic and herbs. Serve right away or at room temperature."],
        "recipe_type": "sides",
        "recipe_time": 50,
        "image": "/images/side1-roasted-eggplants.jpeg"
        
    },
    {
        "recipe_name": "Roasted-Red Potatoes",
        "ingredients": ["1 1/2 pounds small red or white-skinned potatoes (or a mixture)", "1/8 cup good olive oil", "3/4 teaspoon kosher salt", "1/2 teaspoon freshly ground black pepper", "1 tablespoons minced garlic (3 cloves)", "2 tablespoons minced fresh rosemary leaves"],
        "directions": ["Preheat the oven to 400 degrees F.", "Cut the potatoes in half or quarters and place in a bowl with the olive oil, salt, pepper, garlic and rosemary; toss until the potatoes are well coated. Dump the potatoes on a baking sheet and spread out into 1 layer; roast in the oven for at least 1 hour, or until browned and crisp. Flip twice with a spatula during cooking to ensure even browning.", "Remove the potatoes from the oven, season to taste, and serve."],
        "recipe_type": "sides",
        "recipe_time": 68,
        "image": "/images/side2-roasted-red-potatoes.jpg"
        
    },
    {
        "recipe_name": "Quinoa-salad",
        "ingredients": ["12 cups water", "1 1/2 cups quinoa, rinsed", "5 pickling cucumbers, peeled, ends trimmed, and cut into 1/4-inch cubes", "1 small red onion, cut into 1/4-inch cubes", "1 large tomato, cored, seeded, and diced", "1 bunch Italian parsley leaves, chopped", "2 bunches mint leaves, chopped", "1/2 cup extra-virgin olive oil", "1/4 cup red wine vinegar", "1 lemon, juiced", "1 1/2 teaspoons salt", "3/4 teaspoon freshly ground black pepper", "4 heads endive, trimmed and separated into individual spears", "1 avocado, peeled, seeded and diced, for garnish"],
        "directions": ["Bring the water to a boil in a large saucepan. Add the quinoa, stir once, and return to a boil. Cook uncovered, over medium heat for 12 minutes. Strain and rinse well with cold water, shaking the sieve well to remove all moisture.", "When dry, transfer the quinoa to a large bowl. Add the cucumbers, onion, tomato, parsley, mint, olive oil, vinegar, lemon juice, salt, and pepper and toss well. Spoon onto endive spears, top with avocado, and serve."],
        "recipe_type": "entrees",
        "recipe_time": 40,
        "image": "/images/entree1-quinoa-salad.jpeg"
        
    },
    {
        "recipe_name": "Honey Baked Ham",
        "ingredients": ["1 10-pound bone-in smoked ham (with water added)", "1 1/2 cups packed light brown sugar", "1/2 cup clover honey"],
        "directions": ["Adjust the oven racks to accommodate a large roasting pan. Fit the pan with a shallow roasting rack. Preheat the oven to 350 degrees F.", "Unwrap the ham and rinse it under cold water. Place it on the rack in the roasting pan. Cover with foil and bake 1 hour 40 minutes. Meanwhile, combine the brown sugar and honey in a saucepan and cook over medium heat until the mixture is smooth and the sugar has dissolved.", "Pour the brown sugar glaze over the ham and continue roasting1 hour 40 minutes more, basting at least twice with the drippings in the roaster. (To adjust the total roasting time for a smaller or larger ham, calculate 20 minutes per pound.) Check for doneness by inserting a meat thermometer into a meaty spot (not into fat or touching the bone)-it should register 160 degrees F.", "Let the ham stand 15 minutes before slicing to allow the juices to set. (You can make the ham up to 2 hours ahead; tent with foil and serve at room temperature.)"],
        "recipe_type": "entrees",
        "recipe_time": 180,
        "image": "/images/entree2-honey-baked-ham.jpeg"
        
    },
    {
        "recipe_name": "Featherlite Chocolate cake",
        "ingredients": ["12 tablespoons unsalted butter (1 1/2 sticks), plus more for the pan", "1 3/4 cups sugar", "2 eggs", "1 teaspoon pure vanilla extract", "2 1/4 cups sifted cake flour, plus more for the pan", "1/2 cup good-quality cocoa powder, such as Valrhona or Droste", "1 1/4 teaspoons baking soda", "3/4 teaspoon salt", "1 1/4 cups ice water"],
        "directions": ["Serving suggestion: Dust with confectioners' sugar and serve with milk", "Arrange a rack in the upper 1/3 of the oven and preheat to 350 degrees F.", "Butter and flour a bundt pan or tube pan. (You can use a mixture of cocoa powder and flour instead of flour, to prevent white spots on the cake.)", "In a standing mixer fitted with a whisk attachment, or using a hand mixer, cream the butter until light and fluffy. Mix in the sugar. One at a time, mix in the eggs, then the vanilla, occasionally scraping down the mixing bowl.", "Meanwhile, in another bowl, sift together the flour, cocoa powder, baking soda, and 3/4 teaspoon salt.", "Add 1/3 of the flour mixture; then 1/3 of the ice water. Repeat, mixing after each addition. Transfer the batter to the pan and bake until springy and dry, about 40 to 45 minutes.", "Let cool in the pan on a rack, then carefully turn the cake out. Just before serving, sift confectioners' sugar over the top. Serve with very cold milk!"],
        "recipe_type": "desserts",
        "recipe_time": 75,
<<<<<<< HEAD
        "image": "/images/Dessert2-Chocolate-cake.jpeg"
=======
        "image": "/images/Dessert2-Featherlite-Chocolate-cake.jpeg"
>>>>>>> 4680df6c4ea20f40cb661e5515f2833768df9cf0
        
    },
    {
        "recipe_name": "Chess Pie",
        "ingredients": ["2 cups sugar", "1 tablespoon flour", "1 tablespoon fine yellow cornmeal", "4 eggs", "1/4 cup milk", "1/4 cup unsalted butter, melted", "2 tablespoons grated lemon rind", "1/3 cup fresh lemon juice with pulp", "One 9-inch unbaked pie shell", "1 cup heavy cream, whipped"],
        "directions": ["In a large bowl combine the sugar, flour and cornmeal. Blend well, then add the eggs and combine well. Add the milk and mix then stir in the melted butter, lemon rind and juice. Pour this filling into the crust and cover then edge of the crust with foil to prevent it from burning, taking care not to touch the filling. Bake at 375 degrees F for 45 minutes, removing the foil after 30 minutes. Cool and serve or refrigerate overnight but let sit out 3 hours before serving to warm up slightly. Serve with dollops of whipped cream."],
        "recipe_type": "desserts",
        "recipe_time": 60,
        "image": "/images/Dessert3-Chess-Pie.jpeg"
        
    },
    {
        "recipe_name": "Pumpkin Cheesecake",
        "ingredients": ["24 gingersnap cookies (about 5.7 ounces)", "Kosher salt", "4 tablespoons unsalted butter, melted and cooled slightly", "24 ounces cream cheese, at room temperature", "1 cup canned pure pumpkin puree", "2 teaspoons pure vanilla extract", "1/4 teaspoon ground nutmeg", "3 large eggs, at room temperature", "1 cup sugar", "1 1/2 teaspoons ground cinnamon", "1 cup whipped cream"],
        "directions": ["For the cheesecake: Put the cookies and a pinch of salt in a food processor and pulse until the cookies are broken down into fine crumbs. Add the butter and pulse until completely combined. The texture will be similar to wet sand. Press firmly into the bottom and 1 inch up the sides of a 7-inch springform pan. Put the crust in the freezer while you make the filling.", "Wipe out the bowl of the food processor and add the cream cheese, pumpkin puree, vanilla, nutmeg, eggs, 3/4 cup of the sugar and 1 teaspoon of the cinnamon. Process until completely smooth, opening the lid and scraping down the sides of the bowl as needed. Pour the mixture over the crust.", "Tear off a piece of aluminum foil about 1 1/2 feet long and put the springform pan in the center. Wrap the foil around the pan, folding down the sides as needed so the top of the pan isn't covered. The aluminum foil should only be on the outside of the pan. Tear off a second piece of aluminum foil about 2 feet long and lay the foil in front of you with one of the longer sides closest to you. Folding it toward you (the long way), fold the foil in half once then fold once again to create a foil sling for the cheesecake.", "Pour 2 cups water in the bottom of a 6-quart Instant Pot® and insert the machine's trivet. Put the springform pan in the center of the foil sling, then pick up both sides of the sling, bringing them up the sides of the pan. Carefully lower the pan onto the trivet. Fold down the foil sling as needed so that it fits in the pot but does not touch the cheesecake. Follow the manufacturer's guide for locking the lid and preparing to cook. Set to pressure cook on high for 35 minutes.", "After the pressure-cook cycle is complete, turn off the heat and let the steam release naturally for 25 minutes. After 25 minutes, follow the manufacturer's guide for steam release and allow any residual steam to air out. Being careful of any remaining steam, unlock and remove the lid and carefully use the foil sling to lift out the pan and set it over a cooling rack. Remove the foil from around the pan, then use paper towels to blot off any excess liquid from the top and sides of the cheesecake. Use a small offset spatula or the tip of a paring knife to loosen the sides of the cheesecake from the pan. Allow to sit at room temperature until mostly cooled, about 1 hour. Cover with plastic wrap and refrigerate until completely set, at least 4 hours and up to overnight.", "Once fully chilled, remove the plastic wrap from the cheesecake and use a small offset spatula or the tip of a paring knife to again loosen the sides of the cheesecake from the pan. Remove the outer ring and set the cheesecake on a serving dish. Spread the whipped cream over the top. Whisk together the remaining 1/4 cup sugar and 1/2 teaspoon cinnamon in a small bowl. Dust the cinnamon sugar over the top of the cheesecake before slicing."],
        "recipe_type": "desserts",
        "recipe_time": 360,
        "image": "/images/Dessert1-Pumpkin-Cheesecake.jpeg"
        
    },
    {
        "recipe_name": "Classic Shrimp Scampi",
        "ingredients": ["Kosher salt", "12 ounces linguine", "1 1/4 pounds large shrimp, peeled and deveined", "1/3 cup extra-virgin olive oil", "5 cloves garlic, minced", "/4 to 1/2 teaspoon red pepper flakes", "1/3 cup dry white wine", "Juice of 1/2 lemon, plus wedges for serving", "4 tablespoons unsalted butter, cut into pieces", "1/4 cup finely chopped fresh parsley"],
        "directions": ["Bring a large pot of salted water to a boil. Add the linguine and cook as the label directs. Reserve 1 cup cooking water, then drain.", "Meanwhile, season the shrimp with salt. Heat the olive oil in a large skillet over medium-high heat. Add the garlic and red pepper flakes and cook until the garlic is just golden, 30 seconds to 1 minute. Add the shrimp and cook, stirring occasionally, until pink and just cooked through, 1 to 2 minutes per side. Remove the shrimp to a plate. Add the wine and lemon juice to the skillet and simmer until slightly reduced, 2 minutes.", "Return the shrimp and any juices from the plate to the skillet along with the linguine, butter and 1/2 cup of the reserved cooking water. Continue to cook, tossing, until the butter is melted and the shrimp is hot, about 2 minutes, adding more of the reserved cooking water as needed. Season with salt; stir in the parsley. Serve with lemon wedges."],
        "recipe_type": "entrees",
        "recipe_time": 30,
        "image": "/images/entree4-classic-shrimp-scampi.jpeg"
        
    },
    {
        "recipe_name": "Pea Pesto Crostini",
        "ingredients": ["1 (10-ounce) package frozen peas, defrosted", "1 garlic clove", "1/2 cup grated Parmesan", "1 teaspoon kosher salt, plus extra for seasoning", "1/4 teaspoon freshly ground black pepper, plus extra for seasoning", "1/3 cup olive oil", "8 (1/2-inch thick) slices whole-grain baguette or ciabatta bread, preferably day-old", "1/3 cup olive oil", "8 cherry tomatoes, halved or 1 small tomato, diced"],
        "directions": ["For the pea pesto: Pulse together the peas, garlic, Parmesan, 1 teaspoon of salt and 1/4 teaspoon of pepper in a food processor. With the machine running, slowly add the olive oil until well combined, about 1 to 2 minutes. Season with additional salt and pepper, if needed. Transfer to a small bowl and set aside.", "For the crostini: Preheat a stovetop griddle or grill pan on medium-high heat. Brush both sides of the sliced bread with olive oil and grill until golden, about 1 to 2 minutes. Transfer the bread to a clean surface and spread 1 to 2 tablespoons of the prepared pesto on each slice.", "Top with tomato halves and serve."],
        "recipe_type": "starters",
        "recipe_time": 12,
        "image": "/images/starter4-Pea-Pesto-Crostini.jpeg"
        
    }
    






]
